app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "benmeftehjesser@gmail.com"], ["LIMIT", 1]]
---
    def index
        user= User.where(email: params[:email]).first