app/views/articles/index.html.erb

            <div class="d-flex justify-content-between mb-2">
              <p class="text-muted mb-0">Comments: <span class="fw-bold"><%=article.comments.count%></span></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]