app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "articles" SET "status" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["status", "public"], ["updated_at", "2023-03-21 09:24:22.461409"], ["id", 2]]
---
  def update
    @article = Article.find(params[:id])


    if @article.update(article_params)